<template>
  <div id="AgreeBook">
    <div class="yle-law-book">
      <h2 class="book-title">优乐商城用户协议</h2>
      <div class="book-content" :style="bheight">
        <div class="text_list">
          <div class="">
            <p style="font-size: 14px; line-height: 1.71429;"> 本协议由您与华为软件技术有限公司（“华为云”）签订。您确认您有签订本协议的全部授权与权限。如果您代表某一实体签订本协议，您确认您已获得该实体的授权，有权代表其接受本协议，在此情形下，本协议以下提及的“您”即代表该实体。您勾选《华为云用户协议》并点击同意按钮即表示您同意并接受本协议的全部内容。如果您不同意本协议的内容，请勿点击“同意”按钮。 </p>
          </div>
        </div>
        <div class="text_list">
          <div class="law_st-2" name="article-1" id="article-1">
            一、定义
          </div>
          <ul class="law_ml20">
            <li class=""> 1.1 “云服务”指华为云服务网站（www.huaweicloud.com）上展示并提供的云服务，不包括第三方内容（SLA另有明确约定的情形除外）。具体服务内容以您所订购的内容为准。 </li>
            <li class=""> 1.2 “第三方内容”指第三方在华为云服务网站上提供的内容或同服务一起为用户提供的内容。 </li>
            <li class=""> 1.3 “您的内容”是指您或任何“最终用户”上传或存储在云服务中的内容，以及任何您或任何“最终用户”通过使用云服务而产生的计算结果。本协议规定的云服务，华为的产品和服务及华为的知识产权和上述各项的所有衍生作品，以及“账户信息”，均不在“您的内容”的定义范围之内。 </li>
            <li class=""> 1.4 “服务等级协议”指华为云在华为云服务网站上公布的关于云服务的《服务等级协议（SLA）》（简称SLA）。 </li>
            <li class=""> 1.5 “最终用户”指您的雇员、外包人员及类似人员和客户，即任何访问或使用您的账户、您的内容或业务的个人、法人或其他组织。 </li>
            <li class=""> 1.6 “暂停”指华为云为您开通的云服务只能通过管理控制台查询和显示，但暂时不能进行管理和维护操作，也暂时不能访问和使用这些资源。 </li>
            <li class=""> 1.7 “终止”指华为云为您开通的云服务不再能通过管理控制台查询和显示，不再能进行管理和维护操作，也不再能访问和使用这些资源。 </li>
          </ul>
        </div>
        <div class="text_list">
          <div class="law_st-2" name="article-3" id="article-3">
            三、您的权利及义务
          </div>
          <ul class="law_ml20">
            <li class=""> 3.1 在本协议有效期内，您可以使用您的账户登录华为云服务网站，订购和管理云服务。您应对您的账户的全部行为承担责任，您的账户的行为均应被视为您的行为。 </li>
            <li class=""> 3.2 就您订购并开通的华为云服务，华为云授予您非排他的、不可转让的、受限的许可，您可依照本协议及相关订单的约定访问及使用华为云服务。如您允许、协助或方便任何最终用户访问或使用您订购的华为云服务或您的内容，您应保证最终用户遵守本协议的约定并对最终用户的使用行为承担全部责任。如果您使用华为云服务向最终用户提供服务，您应与最终用户单独签署相关合同，华为云不直接向最终用户提供任何支持或服务，亦不承担任何责任。 </li>
            <li class=""> 3.3您确认并保证您已获得与订购、访问及使用华为云服务相关的全部授权、许可与批准。如您通过华为云提供服务或开展业务，您应保证依照法律法规的规定获得相关备案、审批与许可。您未满足该等要求导致的全部责任由您自行承担，同时您应赔偿因此给华为云造成的损失。 </li>
            <li class=""> 3.4 您对您的内容的准确性、质量、完整性、合法性、可靠性以及适当性承担全部责任，并且负责获得所有与华为云提供云服务所需的您的内容相关的权利与许可。 </li>
            <li class=""> 3.5 您及您的最终用户访问及使用云服务应遵守《可接受的使用政策》。您可通过以下网址查阅该政策：【http://www.huaweicloud.com/declaration/sa_nisr.html】。 </li>
            <li class=""> 3.6 您应仔细阅读并遵守华为云在云服务网站页面上展示的相应服务说明、技术规范、使用流程、操作文档等内容，并准确理解相关内容及可能发生的后果；在使用服务过程中，您应依照相关操作指引进行操作，对于您违反相关操作指引所引起的后果由您自行承担，华为云不承担任何责任； </li>
          </ul>
        </div>
        <div class="text_list">
          <div class="law_st-2" name="article-4" id="article-4">
            四、华为云的权利及义务
          </div>
          <ul class="law_ml20">
            <li class=""> 4.1 华为云将依照本协议的约定提供您所订购的云服务，并负责云服务的日常维护及故障排除，但因您的原因、不可抗力或非华为云可控的原因导致的故障情形除外。 </li>
            <li class=""> 4.2 华为云将在需要时对云服务进行升级，或将云服务环境进行机房迁移。华为云进行上述操作前将提前3日发出公告或通知，您应对华为云的升级予以支持与配合。因您不配合华为云进行升级而导致的任何后果，由您承担全部责任。 </li>
            <li class=""> 4.3 您理解并同意，华为云有权根据实际需要变更、暂停或取消部分云服务或其某种规格、特性、功能、API接口。华为云将通过在华为云服务网站上公布或以电子邮件的方式通知您。 </li>
            <li class=""> 4.4您认可并同意，基于运维管理需要，华为云提供云服务时有可能对您的内容进行迁移、维护等操作。您认可并同意前述对您的内容及其中涉及的任何数据（含个人数据）的迁移与维护是华为云为您提供云服务所必须的，并不构成对您的隐私或保密信息的任何侵犯。在华为云遵守章节八保密义务并采取适当安全措施的前提下，您明确同意并授权华为云在本协议期限内为提供云服务之目的，迁移、维护任何您的内容及其中涉及的任何数据（含个人数据）。 </li>
            <li class=""> 4.5您认可并同意，由于部分优惠活动或政策是基于您对于服务时长或服务量的使用承诺为前提，因此，若您提前退订相应服务，华为云有权采取恢复原价计费、收取违约金或收取退订/退款手续费、作废代金券，要求您偿付已使用免费代金券的费用等方式进行处理，具体规则以华为云服务相应展示页面或相应订单中载明的方式为准。 </li>
          </ul>
        </div>
        <div class="text_list">
          <div class="law_st-2" name="article-16" id="article-16">
            五、其他
          </div>
          <ul class="law_ml20">
            <li class=""> 5.1 华为云有权在不影响您在本协议项下权利的前提下将本协议项下的部分或全部权利或义务转让给第三方。发生前述转让后，本协议仍具有法律约束力，保护本协议双方以及各自华为云权利义务继受者和受让人的利益。 </li>
            <li class=""> 5.2本协议项下华为云所有的通知均可通过华为云服务网站公告、电子邮件或常规的信件传送等方式进行，该等通知于发送之日视为已送达收件人，通过邮件发布的通知在邮件寄出时生效。您应及时更新您的电子邮箱地址。无论您是否真正收到邮件，当通知发往您账户的关联电子邮箱时，即视为您已经收到邮件。 </li>
            <li class=""> 5.3 双方承诺遵守本协议所适用的联合国、中国、美国以及其他国家出口管制法律法规。您承诺不会将华为云提供的产品或服务用于适用的出口管制法律所禁止的用途。非经相关主管机关许可，您及您授权使用华为云的其他个人或实体不会通过华为云服务向所适用的出口管制法律禁止的实体或个人提供受控的技术、软件或服务。 </li>
            <li class=""> 5.4 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。 </li>
            <li class=""> 5.5 您再次确认并声明：已经仔细阅读并完全理解本协议条款，对于存有疑问的条款已经要求并得到华为云的充分说明，并接受上述所有条款的约定。 </li>
          </ul>
        </div>
      </div>
    </div>
    <div class="yle-submit">
      <el-button type="primary" @click="agreedUserBook">我已阅读并同意优乐商城用户协议</el-button>
      <el-button @click="close">延后处理</el-button>
    </div>
  </div>
</template>
<script>
import {agreeUserBook} from '../proxy'
export default {
  props: {
    step: {
      type: Number,
      default: 1
    },
    closeModel: {
      type: Boolean,
      default: false
    }
  },
  computed: {
    bheight () {
      return {
        height: this.wHeigth - 300 + 'px'
      }
    }
  },
  watch: {
    'store.state.windowHeight' (val) {
      this.wHeigth = val
    }
  },
  data () {
    return {
      wHeigth: this.store.state.windowHeight
    }
  },
  mounted () {},
  methods: {
    agreedUserBook () {
      agreeUserBook().then((res) => {
        if (res.code * 1 === 0) {
          this.$notify({
            title: '提示',
            message: '您已同意《优乐商城用户协议》',
            type: 'success'
          })
          this.$emit('update:step', 2)
        }
      })
    },
    close () {
      this.$emit('update:closeModel', true)
    }
  }
}
</script>
<style scoped lang="scss">
  @import "./style.scss";
</style>
